# 숫자형
## x의 y제곱을 나타내는 ** 연산자
# a = 3
# b = 4
# result = a ** b
# print("1. 3의 4제곱 = " + str(result))       # 출력: 81

# sum = 10 * 18 ** 2 + 2 * 11
# print("미니문제. 10 x 18의 2제곱 + 2 x 11 =",sum)        # 출력: 3262

#----------------------------------
# 나눗셈 후 나머지를 리턴하는 % 연산자
# x = 7 % 3
# print("7 % 3 = " + str(x))        # 출력: 1

#----------------------------------
## 나눗셈 후 몫을 리턴하는 // 연산자
# a = 7 / 4
# b = 7 // 4
# print(f"7 / 4 = {a}")       # 1.75
# print(f"7 // 4 = {b}")      # 1

### 미니문제
a = 14 % 3
b = 14 // 3
print(f"몫: {b}, 나머지: {a}")